site_menu = [
    {
        "name": "каталог",
        "url": "",
        "sub_menu": [
            {"name": "весь", "url": "products"},
            {"name": "одежда", "url": "products", "cat": "clothes"},
            {"name": "обувь", "url": "products", "cat": "shoes"},
        ],
    },
    {"name": "о нас", "url": "about"},
]

catalog = {
    "clothes": {
        "title": "Одежда",
        "items": [
            {
                "id": 8,
                "title": "Рубашка льняная",
                "brand": "Etikmen",
                "description": "Наше основное видение заключается в следующем: ДОСТУПНАЯ ЦЕНА, ВЫСОКОЕ КАЧЕСТВО Стильная современная мужская рубашка льянная однотонная с длинным рукавом приталенного силуэта и воротником -мандарин бренда ETIKMEN в эксклюзивной подарочной коробке! - выбор современных мужчин, который подчеркнет достоинства мужской фигуры. Это одна из самых трендовых позиций 2023 года мужской моды. Состав из хлопка позволит вашей коже свободно дышать в жаркое время года. Ткань очень нежная, дышащая, обладает антибактериальными свойствами Приятная к телу, отличается плотностью и долговечностью, хорошо пропускает воздух и практически не мнется, отлично подходит на каждый день.",
                "price": 3743,
                "rating": 4.8,
                "image_url": "img/products/product_clothes_1.webp",
            },
            {
                "id": 9,
                "title": "Худи оверсайз",
                "brand": "TERRA PRO",
                "description": "Худи оверсайз с капюшоном - это прекрасный выбор для стильных и модных мужчин! Эта толстовка отличается своей универсальностью и многогранностью: она может быть как одеждой для повседневной носки, так и элементом стильного образа. Свитшот изготовлен из качественного материала с 3D фактурой, что делает его практичным и уникальным. Эта мужская толстовка подходит для всех возрастов и размеров: от подростков до взрослых мужчин. Белый цвет делает эту кофту однотонной, но при этом она выглядит очень стильно и привлекательно. Наслаждайтесь комфортом и теплом в любое время года! Terra Pro создает одежду, в которой наш клиент будет чувствовать уверенность, приоритет бренда - положительные эмоции покупателя.",
                "price": 1889,
                "rating": 4.7,
                "image_url": "img/products/product_clothes_2.webp",
            },
            {
                "id": 10,
                "title": "Водолазка",
                "brand": "Urban Style",
                "description": "Модель имеет полноту 6 (F), подходит на среднюю стопу. Для Вашего удобства представляем длину стельки для каждого размера модели: 36 рр 23 см,37 рр 23,5 см,38 рр 24 см,39 рр 24,5 см,40 рр 25 см. В коллекции O`SHADE все самое лучшее с модных подиумов Европы: для Вас актуальные цветовые гаммы, ультрамодные, но универсальные силуэты и самые новые натуральные материалы. В коллекции представлены разнообразные модели женской и детской обуви, а также стильные женские сумки. Трендовые ботинки женские весна челси и ботинки женские весенние на шнурках и на молнии в коллекции ошейд выполнены из натуральной кожи или замши.",
                "price": 1036,
                "rating": 4.7,
                "image_url": "img/products/product_clothes_3.webp",
            },
            {
                "id": 11,
                "title": "Топ женский черный белый милый топ спортивный без рукавов",
                "brand": "Korean Style Shop",
                "description": "Женские топы из 100% хлопка - идеальный выбор для вашего летнего гардероба! Наша коллекция предлагает множество стильных и универсальных моделей топов, которые прекрасно сочетаются с любыми низами и подходят для различных случаев. Наши топы обладают мягкой и эластичной тканью, которая дышит, обеспечивая комфорт даже в жаркие дни. Белый топик станет прекрасным дополнением вашего образа, будь то с шортами, длинными брюками, джинсами или леггинсами. Вы также можете носить его под пиджаком или блейзером для создания стильного офисного образа. Наш кроп топ женский является не только модным, но и удобным решением.",
                "price": 828,
                "rating": 4.7,
                "image_url": "img/products/product_clothes_4.webp",
            },
            {
                "id": 12,
                "title": "Костюм деловой брючный праздничный вечерний офисный нарядный",
                "brand": "MILLYS",
                "description": "Стильный и нарядный строгий брючный костюм с безрукавкой и поясом - это топовая модель 2023 года. Вы приятно удивитесь как приталенный жилет на пуговице и зауженные укороченные облегающие брюки на молнии прекрасно сочетаются множеством вещей в женском гардеробе, создавая трендовый базовый офисный женский капсульный гардероб и подходят как очень высоким, так и невысоким. Наша команда гарантирует множество привлекательных повседневных образов, «на выход» с использованием таких элементов, как: блуза, оверсайз рубашка, топ, футболка с принтом, водолазка с коротким рукавом, майка или же блузка с рукавом три четверти. Костюм с длинным жилетом выбирают как взрослые на работу в офис, праздник или юбилей, так и подростки - девушки в школу, создавая оригинальный подростковый образ, на вечеринку, выпускной, торжество, свидание или прогулку.",
                "price": 3729,
                "rating": 4.5,
                "image_url": "img/products/product_clothes_5.webp",
            },
        ],
    },
    "shoes": {
        "title": "Обувь",
        "items": [
            {
                "id": 1,
                "title": "Ботинки кожаные из велюра теплые на низком каблуке шнурках",
                "brand": "Highlander",
                "description": "Высота каблука 2,5 см. Женские демисезонные ботинки из натуральной кожи, это практичная модель на осенне весенний период. Кожаные полусапожки на небольшой платформе станут замечательным выбором на каждый день. Короткие полусапоги мартинсы можно купить к любой верхней одежде. Стильная замшевая обувь на низком каблуке превосходно сочетается и с классическим пальто, и со спортивной курткой. Теплые ботинки на шнуровке станут надежным вариантом в непогоду.",
                "price": 4161,
                "rating": 4.5,
                "image_url": "img/products/product_shoes_1.webp",
            },
            {
                "id": 2,
                "title": "Весенние ботинки натуральная кожа",
                "brand": "Baden",
                "description": "Ботинки женские демисезонные Baden сочетание комфорта и актуальной классики. Натуральная кожа высокого качества придает изысканный внешний вид и способствует оптимальному микроклимату для стопы. Ботинки кожаные женские долговечны и не требуют трудоемкого ухода, надолго сохраняя первоначальный вид.",
                "price": 2898,
                "rating": 4.8,
                "image_url": "img/products/product_shoes_2.webp",
            },
            {
                "id": 3,
                "title": "Ботинки весенние натуральная кожа на шнуровке",
                "brand": "O`SHADE",
                "description": "Модель имеет полноту 6 (F), подходит на среднюю стопу. Для Вашего удобства представляем длину стельки для каждого размера модели: 36 рр 23 см,37 рр 23,5 см,38 рр 24 см,39 рр 24,5 см,40 рр 25 см. В коллекции O`SHADE все самое лучшее с модных подиумов Европы: для Вас актуальные цветовые гаммы, ультрамодные, но универсальные силуэты и самые новые натуральные материалы. В коллекции представлены разнообразные модели женской и детской обуви, а также стильные женские сумки. Трендовые ботинки женские весна челси и ботинки женские весенние на шнурках и на молнии в коллекции ошейд выполнены из натуральной кожи или замши.",
                "price": 3912,
                "rating": 4.6,
                "image_url": "img/products/product_shoes_3.webp",
            },
            {
                "id": 4,
                "title": "Ботинки кожаные из велюра теплые на низком каблуке шнурках",
                "brand": "Highlander",
                "description": "Высота каблука 2,5 см. Женские демисезонные ботинки из натуральной кожи, это практичная модель на осенне весенний период. Кожаные полусапожки на небольшой платформе станут замечательным выбором на каждый день. Короткие полусапоги мартинсы можно купить к любой верхней одежде. Стильная замшевая обувь на низком каблуке превосходно сочетается и с классическим пальто, и со спортивной курткой. Теплые ботинки на шнуровке станут надежным вариантом в непогоду.",
                "price": 4161,
                "rating": 4.5,
                "image_url": "img/products/product_shoes_1.webp",
            },
            {
                "id": 5,
                "title": "Весенние ботинки натуральная кожа",
                "brand": "Baden",
                "description": "Ботинки женские демисезонные Baden сочетание комфорта и актуальной классики. Натуральная кожа высокого качества придает изысканный внешний вид и способствует оптимальному микроклимату для стопы. Ботинки кожаные женские долговечны и не требуют трудоемкого ухода, надолго сохраняя первоначальный вид.",
                "price": 2898,
                "rating": 4.8,
                "image_url": "img/products/product_shoes_2.webp",
            },
            {
                "id": 6,
                "title": "Ботинки весенние натуральная кожа на шнуровке",
                "brand": "O`SHADE",
                "description": "Модель имеет полноту 6 (F), подходит на среднюю стопу. Для Вашего удобства представляем длину стельки для каждого размера модели: 36 рр 23 см,37 рр 23,5 см,38 рр 24 см,39 рр 24,5 см,40 рр 25 см. В коллекции O`SHADE все самое лучшее с модных подиумов Европы: для Вас актуальные цветовые гаммы, ультрамодные, но универсальные силуэты и самые новые натуральные материалы. В коллекции представлены разнообразные модели женской и детской обуви, а также стильные женские сумки. Трендовые ботинки женские весна челси и ботинки женские весенние на шнурках и на молнии в коллекции ошейд выполнены из натуральной кожи или замши.",
                "price": 3912,
                "rating": 4.6,
                "image_url": "img/products/product_shoes_3.webp",
            },
            {
                "id": 7,
                "title": "Ботинки весенние натуральная кожа на шнуровке",
                "brand": "O`SHADE",
                "description": "Модель имеет полноту 6 (F), подходит на среднюю стопу. Для Вашего удобства представляем длину стельки для каждого размера модели: 36 рр 23 см,37 рр 23,5 см,38 рр 24 см,39 рр 24,5 см,40 рр 25 см. В коллекции O`SHADE все самое лучшее с модных подиумов Европы: для Вас актуальные цветовые гаммы, ультрамодные, но универсальные силуэты и самые новые натуральные материалы. В коллекции представлены разнообразные модели женской и детской обуви, а также стильные женские сумки. Трендовые ботинки женские весна челси и ботинки женские весенние на шнурках и на молнии в коллекции ошейд выполнены из натуральной кожи или замши.",
                "price": 3912,
                "rating": 4.6,
                "image_url": "img/products/product_shoes_3.webp",
            },
        ],
    },
}


def get_product_by_id(id: int) -> dict:
    for value in catalog.values():
        for item in value["items"]:
            if item["id"] == id:
                return item
